from django.shortcuts import render
from datetime import date  # 글로벌 모듈 임폴트
import random #진짜 랜덤 임포트
import hgtk # 한글 자모음



def index(request):
    return render(request, 'index.html')


def about(request):
    return render(request, 'about.html')


def contact(request):
    return render(request, 'contact.html')


def moora_project_list(request):
    return render(request, 'moora_project_list.html')


def A_name_list(request):
    return render(request, 'A_name_list.html')


def A1_easy_name(request):
    return render(request, 'A1_easy_name.html')

def result_A1(request):  # 무지 추가
    bday = request.GET.get('bday')
    easy_name = ['려진', '린동', '나찬', '동운', '인찬', '진송', '해니', '강군', '종보', '진민', '나강', '수찬', '해안', '산동', '운민', '찬단', '나찬', '동훈', '홍니',
                 '산여', '훈군', '기보', '나진', '수란', '찬단', '민나', '기강', '한보', '모동', '린찬', '기모', '수저', '빈운', '군강', '군모', '산니', '론단', '찬단',
                 '려진', '어빈', '세래', '민린', '빈해', '인단', '빈모', '어종', '찬찬', '빈군', '단운', '모운', '군훈', '니모', '동나', '해군', '서찬', '동찬', '론찬',
                 '린래', '운단', '니단', '단휘', '기여', '종기', '단홍', '휘자', '운래', '여군', '민강', '동동', '빈군', '안훈', '모기', '모단', '빈민', '휘운', '여보',
                 '찬한', '한종', '군신', '동모', '어단', '단찬', '래란', '민안', '휘찬', '모루', '나찬', '찬니', '단린', '찬민', '군진', '동모', '찬종', '해기', '운보',
                 '안찬', '보여', '해기', '래모', '보찬', '해니', '기군', '찬빈', '인종', '빈어', '해모', '빈모', '모빈', '나수', '보보', '모안', '산수', '저안', '찬모',
                 '한준', '모신', '홍란', '기니', '군안', '빈나', '보기', '빈단', '려기', '찬니', '보보', '해종', '찬신', '래려', '민기', '니홍', '훈찬', '찬루', '여자',
                 '여나', '운나', '빈빈', '니기', '군찬', '려산', '준니', '운모', '온찬', '종단', '단나', '단찬', '찬니', '홍빈', '민니', '강해', '보빈', '니휘', '빈니',
                 '니모', '나찬', '동기', '니민', '해안', '운온', '자나', '준단', '군린', '인단', '민동', '니준', '종준', '훈산', '한어', '니단', '린모', '려운', '종보',
                 '찬려', '나란', '민니', '찬보', '보린', '민휘', '여신', '보려', '단찬', '기단', '나강', '기군', '온려', '홍세', '니나', '홍세', '보민', '단나', '보보',
                 '니홍', '니단', '준란', '인민', '빈민', '한군', '기빈', '단자', '니강', '래해', '래훈', '보재', '빈동', '준니', '동니', '나찬', '동니', '민루', '세려',
                 '종민', '운니', '민나', '빈모', '서동', '니군', '훈모', '빈홍', '강인', '산나', '한니', '해보', '군안', '보강', '훈해', '나휘', '민래', '여빈', '린민',
                 '빈휘', '종홍', '기준', '인강', '한안', '빈안', '군니', '수빈', '나단', '단보', '니단', '찬론', '홍동', '저찬', '훈자', '빈준', '려찬', '자휘', '산모',
                 '수진', '민빈', '세빈', '단래', '운니', '민란', '니홍', '보찬', '니준', '빈란', '래홍', '빈단', '안모', '강니', '려홍', '진훈', '훈세', '빈세', '종저',
                 '단훈', '기기', '나기', '니서', '려준', '찬니', '찬진', '안저', '훈모', '한기', '민저', '민자', '동민', '루자', '여종', '동민', '진신', '니준', '단단',
                 '단민', '찬민', '빈신', '나자', '모보', '홍찬', '기빈', '보찬', '기모', '모나', '운찬', '단찬', '니모', '홍단', '진루', '보찬', '모수', '재한', '기저',
                 '운수', '민찬', '송찬', '준휘', '어종', '찬니', '종찬', '모기', '루강', '기론', '인동', '동찬', '민란', '재군', '찬종', '진빈', '신온', '려찬', '저니',
                 '찬해', '나단', '온온', '나휘', '빈동', '찬단', '운휘', '보나', '빈온', '빈수', '민루', '린니', '단찬', '자기', '수군', '모강', '단군', '인단', '어온',
                 '나민', '모모', '자온', '래단', '모홍', '여찬', '모군', '찬려', '찬민', '강산', '려빈', '동저', '단해', '찬루', '단산', '송찬', '인기', '기빈', '나여',
                 '기운', '빈산', '니모', '휘훈']
    month = bday[5:7]
    day = bday[8:]
    d0 = date(2019, 1, 1)
    d1 = date(2019, int(month), int(day))  # 날짜 저장.
    delta = d1 - d0
    result = easy_name[delta.days]
    context = { 'name': result}
    return render(request, 'result_A1.html', context)


def A2_global_name(request):
    return render(request, 'A2_global_name.html')

def result_A2(request):  # 무지 추가
    bday = request.GET.get('bday')
    sex = request.GET.get('sex')

    global_popular_m_name = ['비한', '에런', '이안', '테오', '다니엘', '라일리', '다니엘', '레오', '로건', '로건',
                             '해리', '해리', '레오', '테오', '로건', '단테', '다니엘', '이반', '시온', '리오',
                             '시온', '다니엘', '해리', '리오', '라일리', '이든', '이반', '이안', '노아', '노아',
                             '다니엘', '라일리', '해리', '시온', '아서', '이든', '리오', '아서', '이든', '테오',
                             '로건', '테오', '이안', '리오', '에단', '이안', '단테', '이안', '테오', '에단', '조엘',
                             '로건', '비한', '다니엘', '에런', '이든', '노아', '이든', '조엘', '라일리', '하디',
                             '테오', '테오', '단테', '이안', '다니엘', '에런', '해리', '로건', '시온', '비한',
                             '단테', '하디', '비한', '해리', '단테', '다니엘', '비한', '해리', '로건', '에단',
                             '에런', '리오', '에런', '노아', '하디', '테오', '노아', '레오', '이든', '테오', '하디',
                             '로건', '로건', '이든', '아서', '리오', '비한', '아서', '테오', '레오', '에단', '이안',
                             '다니엘', '라일리', '아서', '아서', '아서', '비한', '해리', '라일리', '해리', '리오',
                             '아서', '레오', '이든', '해리', '단테', '조엘', '라일리', '해리', '하디', '라일리',
                             '이든', '시온', '리오', '이든', '로건', '에런', '이반', '해리', '라일리', '하디', '조엘',
                             '에단', '에단', '노아', '레오', '로건', '로건', '해리', '테오', '이안', '테오', '테오',
                             '리오', '라일리', '조엘', '시온', '이든', '리오', '레오', '이반', '이든', '이든', '이든',
                             '테오', '리오', '리오', '에단', '비한', '시온', '라일리', '이반', '에런', '이든',
                             '다니엘', '라일리', '비한', '로건', '이든', '조엘', '단테', '레오', '이든', '로건', '에런',
                             '비한', '로건', '다니엘', '단테', '이든', '이든', '에런', '에런', '이든', '레오', '로건',
                             '라일리', '시온', '다니엘', '비한', '시온', '시온', '리오', '이안', '시온', '이안', '이반',
                             '아서', '해리', '시온', '리오', '테오', '아서', '이반', '이든', '하디', '테오', '아서',
                             '에단', '에런', '레오', '라일리', '이반', '비한', '조엘', '이든', '노아', '단테', '시온',
                             '라일리', '해리', '아서', '로건', '이든', '리오', '시온', '비한', '리오', '하디', '조엘',
                             '에런', '테오', '단테', '테오', '라일리', '이안', '하디', '아서', '에단', '로건', '해리',
                             '테오', '다니엘', '다니엘', '하디', '에런', '이든', '테오', '해리', '레오', '라일리', '하디',
                             '이든', '조엘', '테오', '노아', '테오', '이든', '해리', '테오', '라일리', '다니엘', '이안',
                             '레오', '이든', '에단', '로건', '이든', '로건', '해리', '비한', '에런', '다니엘', '테오',
                             '테오', '테오', '에단', '레오', '테오', '에런', '이안', '에단', '아서', '레오', '하디',
                             '이든', '이든', '노아', '에런', '에단', '노아', '해리', '레오', '이든', '다니엘', '조엘',
                             '아서', '해리', '시온', '조엘', '해리', '다니엘', '테오', '아서', '단테', '에런', '로건',
                             '레오', '시온', '시온', '시온', '단테', '에런', '시온', '로건', '이반', '테오', '테오',
                             '로건', '시온', '단테', '해리', '시온', '이안', '라일리', '라일리', '비한', '조엘', '이반',
                             '리오', '단테', '이안', '에런', '레오', '아서', '해리', '다니엘', '에단', '에런', '리오',
                             '에런', '하디', '에런', '레오', '에단', '시온', '로건', '이안', '단테', '이반', '하디',
                             '비한', '리오', '비한', '해리', '테오', '이안', '이안', '리오', '라일리', '노아', '테오',
                             '라일리']
    global_popular_fm_name = ['쥬리', '사라', '모건', '지안', '지안', '지안', '쥬리', '쥬리', '모건', '아린', '일라',
                              '모건', '다나', '엘라', '사라', '나나', '나나', '지안', '해리', '리나', '지아', '엘라',
                              '한나', '아론', '다나', '지안', '해리', '쥬리', '제나', '하니', '아론', '해리', '제나',
                              '리나', '모건', '나나', '쥬리', '다나', '다나', '리나', '일라', '모건', '노라', '일라',
                              '지나', '제나', '리나', '테사', '제나', '일라', '엘라', '이비', '나나', '지나', '제나',
                              '이젤', '지안', '리나', '노라', '한나', '이젤', '이젤', '지아', '이젤', '아론', '하니',
                              '일라', '아론', '사라', '지나', '루미', '한나', '쥬리', '한나', '노라', '이젤', '나나',
                              '나나', '쥬리', '한나', '아린', '일라', '제나', '아린', '리나', '다나', '지안', '지나',
                              '이비', '하니', '제나', '아론', '이젤', '조이', '조이', '이비', '테사', '하니', '아론',
                              '아론', '사라', '모건', '한나', '해리', '제나', '조이', '지아', '한나', '제나', '다나',
                              '하니', '아론', '이젤', '한나', '사라', '제나', '이젤', '조이', '지나', '사라', '지아',
                              '이젤', '일라', '엘라', '다나', '나나', '아린', '조이', '루미', '사라', '엘라', '지안',
                              '이비', '아론', '노라', '지아', '한나', '하니', '일라', '지아', '이비', '지안', '일라',
                              '모건', '한나', '지나', '일라', '테사', '하니', '조이', '테사', '이젤', '일라', '일라',
                              '루미', '리나', '사라', '엘라', '조이', '테사', '다나', '노라', '리나', '해리', '루미',
                              '쥬리', '한나', '제나', '지안', '아론', '나나', '노라', '하니', '지안', '노라', '하니',
                              '지아', '리나', '한나', '나나', '지안', '쥬리', '해리', '해리', '나나', '리나', '조이',
                              '지나', '이젤', '모건', '리나', '한나', '루미', '엘라', '아론', '해리', '엘라', '한나',
                              '쥬리', '테사', '지나', '다나', '지안', '해리', '제나', '다나', '이젤', '지아', '사라',
                              '이비', '리나', '나나', '지아', '다나', '아론', '제나', '나나', '해리', '엘라', '리나',
                              '지아', '쥬리', '사라', '조이', '엘라', '지나', '쥬리', '이비', '루미', '하니', '루미',
                              '다나', '지나', '지아', '지아', '나나', '지안', '하니', '아린', '지안', '모건', '일라',
                              '이젤', '테사', '엘라', '다나', '테사', '사라', '조이', '노라', '하니', '하니', '한나',
                              '이젤', '이젤', '일라', '아론', '사라', '리나', '해리', '지아', '이젤', '지나', '테사',
                              '지안', '나나', '이비', '한나', '아린', '엘라', '지아', '사라', '리나', '하니', '하니',
                              '사라', '지나', '모건', '사라', '일라', '이젤', '엘라', '루미', '다나', '하니', '지아',
                              '지안', '아린', '아린', '하니', '사라', '쥬리', '이젤', '이젤', '모건', '지나', '하니',
                              '아린', '리나', '지안', '조이', '하니', '아린', '엘라', '지안', '쥬리', '아론', '지나',
                              '지안', '일라', '쥬리', '일라', '쥬리', '쥬리', '일라', '지아', '아린', '이젤', '리나',
                              '모건', '테사', '다나', '테사', '사라', '엘라', '모건', '한나', '일라', '지나', '리나',
                              '이비', '제나', '제나', '지아', '조이', '지안', '아론', '제나', '엘라', '지아', '노라',
                              '리나', '제나', '모건', '일라', '이비', '제나', '지나', '리나', '쥬리', '지안', '리나',
                              '아린', '나나', '조이', '노라', '쥬리', '이젤', '이젤', '지안', '모건', '하니', '노라',
                              '이젤', '제나']

    month = bday[5:7]
    day = bday[8:]
    d0 = date(2019, 1, 1)
    d1 = date(2019, int(month), int(day))  # 날짜 저장.
    delta = d1 - d0

    if (sex == '1'):
        result = global_popular_m_name[delta.days]
    elif (sex == '0'):
        result = global_popular_fm_name[delta.days]
    context = {'bday': bday, 'sex': sex, 'name': result}
    return render(request, 'result_A2.html', context)


def A3_pure_name(request):
    return render(request, 'A3_pure_name.html')

def result_A3(request):  # 무지 추가
    bday = request.GET.get('bday')
    sex = request.GET.get('sex')
    korea_pure_m_name = ['다한', '동은', '다온', '찬', '나로', '진이', '가람', '다빈',
                         '다참', '지후', '해솔', '은호', '가람', '시원', '바다', '하람',
                         '한결', '내담', '슬찬', '다옴', '시원', '나로', '한결', '파란',
                         '다한', '하람', '바름', '시원', '진솔', '다참', '재찬', '한울',
                         '바다', '한빛', '가온', '늘찬', '하랑', '이현', '파란', '가람',
                         '슬찬', '찬들', '나오', '가온', '찬', '찬', '은새', '다빈',
                         '시원', '진솔', '시원', '가림', '세찬', '은호', '하랑', '세움',
                         '재찬', '동은', '늘찬', '찬늘', '다옴', '다빈', '찬슬', '우솔',
                         '늘찬', '로지', '세움', '다올', '보단', '이현', '은호', '다옴',
                         '찬들', '슬찬', '한빛', '겨루', '다빈', '조은', '슬찬', '진이',
                         '그리', '찬들', '다올', '다한', '조은', '세움', '이현', '나오',
                         '파란', '슬찬', '은호', '다온', '슬우', '하람', '이현', '다온',
                         '늘찬', '찬늘', '그리', '그리', '솔찬', '세움', '로다', '해솔',
                         '보단', '다올', '이현', '진솔', '진솔', '가림', '이현', '도래',
                         '진솔', '동이', '동이', '슬우', '진솔', '슬우', '해솔', '보단',
                         '보단', '해솔', '진이', '가림', '시원', '세움', '재찬', '도래',
                         '다한', '지후', '가림', '동이', '내담', '노아', '파란', '내담',
                         '하랑', '파란', '진이', '한결', '다참', '우솔', '찬', '진우',
                         '내담', '찬슬', '해솔', '파란', '진솔', '겨루', '늘찬', '조은',
                         '진이', '솔찬', '다옴', '가림', '하랑', '로와', '한결', '진솔',
                         '조은', '바름', '나오', '동이', '다온', '가람', '동은', '한결',
                         '보단', '진솔', '한빛', '찬', '한', '늘찬', '로다', '이현',
                         '하랑', '우솔', '찬', '로와', '지후', '찬슬', '찬늘', '한',
                         '찬슬', '한', '가온', '그리', '지후', '솔찬', '진솔', '로다',
                         '시원', '나오', '우솔', '재찬', '슬찬', '다빈', '마루', '찬들',
                         '늘찬', '로다', '도래', '내담', '한결', '나오', '한결', '로와',
                         '다온', '보담', '찬슬', '지후', '해솔', '다한', '동이', '이현',
                         '로지', '보단', '세찬', '동은', '로와', '진이', '다빈', '하랑',
                         '세움', '다참', '로와', '나로', '바름', '찬슬', '시원', '은새',
                         '나오', '한', '마루', '바다', '보단', '바름', '한울', '찬',
                         '마루', '보단', '한결', '한결', '보담', '솔찬', '우솔', '한',
                         '가람', '세찬', '로다', '노아', '파란', '진이', '한울', '파란',
                         '로다', '동이', '이현', '한빛', '가람', '진우', '은새', '하랑',
                         '지후', '솔찬', '노아', '진우', '겨루', '솔찬', '은새', '슬찬',
                         '그리', '로다', '진솔', '하람', '솔찬', '솔찬', '한', '하람',
                         '내담', '나로', '가온', '보담', '나로', '솔찬', '찬들', '가람',
                         '노아', '늘찬', '바름', '그리', '지후', '은호', '다올', '진이',
                         '다참', '다옴', '지후', '세움', '노아', '다온', '지후', '찬',
                         '슬찬', '다옴', '마루', '늘찬', '진우', '파란', '다참', '찬슬',
                         '동은', '한결', '찬슬', '그리', '은호', '다온', '진이', '동은',
                         '가림', '가온', '한결', '솔찬', '가온', '찬늘', '진우', '찬',
                         '파란', '찬', '솔찬', '한빛', '하랑', '바름', '찬들', '찬늘',
                         '다올', '노아', '다한', '하랑', '가온', '다온', '겨루', '우솔',
                         '늘찬', '찬들', '슬찬', '찬슬', '찬늘', '마루', '진우', '재찬',
                         '다참', '내담', '한결', '로와', '진우', '가림', '진솔', '진이',
                         '찬들', '하랑', '보담', '지후', '바다']
    korea_pure_fm_name = ['가온', '이루리', '은솔', '세리', '빛솔', '진나', '주나',
                          '초롬', '다슬', '로와', '슬기', '나예', '별', '도담', '도담',
                          '주리', '도담', '새나', '라라', '하나', '눈솔', '우솔', '다올',
                          '별', '루라', '나예', '나봄', '보예', '도담', '보늬', '승아',
                          '세리', '별하', '도란', '리라', '다슬', '나래', '라별', '희라',
                          '가람', '마리', '늘봄', '보나', '새론', '새론', '초롬', '초롬',
                          '소예', '은솔', '보미', '이루리', '소예', '아라', '다은', '내담',
                          '라미', '이루리', '승아', '늘봄', '보늬', '라미', '하랑', '라미',
                          '소아', '이루리', '소리', '차미', '이솔', '마리', '희라', '미나',
                          '루라', '도란', '미나', '모아', '늘봄', '라별', '이솔', '슬예',
                          '승아', '나나', '도란', '새론', '나봄', '보나', '늘봄', '보단',
                          '이루리', '로다', '한빛', '주나', '초롬', '다은', '나래', '두나',
                          '마리', '주미', '아라', '보단', '별', '빛솔', '소미', '나예',
                          '라라', '하늬', '주리', '아라', '두나', '두나', '다빈', '빛솔',
                          '아란', '주미', '해솔', '루리', '수련', '세이', '로와', '이솔',
                          '로와', '한빛', '나예', '다빈', '내담', '보단', '리라', '보담',
                          '라라', '도담', '새솔', '내담', '보나', '도담', '세이', '나예',
                          '희라', '이루리', '나예', '지은', '별', '로다', '진이', '도란',
                          '은솜', '나봄', '이솔', '마리', '세이', '마리', '하늬', '라별',
                          '가람', '슬예', '소리', '가림', '수련', '하람', '진솔', '소예',
                          '보단', '리네', '다옴', '나봄', '나봄', '아라', '희라', '내담',
                          '진솔', '지나', '승아', '하나', '소아', '주미', '도란', '나예',
                          '루다', '제나', '도담', '소예', '가림', '초롬', '다빈', '눈솔',
                          '도담', '나봄', '은솔', '수련', '보람', '도담', '다은', '나나',
                          '은솜', '늘봄', '주나', '지은', '도란', '두은', '리네', '슬아',
                          '미나', '이솔', '제나', '가온', '로지', '나예', '제나', '보나',
                          '주리', '가림', '주미', '모아', '하나', '소리', '한빛', '한빛',
                          '주나', '지니', '지나', '나래', '새나', '나래', '나예', '세리',
                          '라별', '하람', '보나', '새론', '별', '리네', '도래', '두은',
                          '슬예', '지나', '주나', '라라', '도래', '가온', '슬예', '우솔',
                          '소미', '비치', '루리', '새솔', '두나', '진나', '늘봄', '우솔',
                          '도담', '소예', '라별', '새나', '진이', '별', '보나', '새론',
                          '모아', '별', '제나', '새론', '보미', '아라', '제나', '나래',
                          '진이', '두나', '누림', '슬아', '소미', '주리', '비치', '루다',
                          '해솔', '하늬', '나나', '가림', '보담', '제나', '승아', '진나',
                          '라라', '다올', '가림', '소아', '은솔', '하나', '보늬', '미나',
                          '제나', '나래', '라별', '차미', '모아', '차미', '하람', '지은',
                          '세리', '슬기', '주나', '보담', '가람', '이솔', '도란', '가온',
                          '지은', '나나', '소리', '슬아', '차미', '은솜', '은솔', '아란',
                          '별하', '두은', '내담', '다올', '도래', '루리', '마리', '도래',
                          '해솔', '지니', '소아', '희라', '빛솔', '도담', '도래', '미나',
                          '비치', '세리', '슬기', '루라', '슬아', '별하', '보나', '다빈',
                          '하나', '다옴', '나래', '아란', '주미', '우솔', '리네', '두나',
                          '하람', '도란', '승아', '은솔', '슬예', '승아', '차미', '지나',
                          '은솜', '라라', '지나', '은솜', '다빈', '비치', '루다', '리라',
                          '로지', '라라', '가람', '한빛', '한빛', '나예']

    month = bday[5:7]
    day = bday[8:]
    d0 = date(2019, 1, 1)
    d1 = date(2019, int(month), int(day))  # 날짜 저장.
    delta = d1 - d0

    if (sex == '1'):
        result = korea_pure_m_name[delta.days]
    elif (sex == '0'):
        result = korea_pure_fm_name[delta.days]

    context = {'bday': bday, 'sex': sex, 'name': result}
    return render(request, 'result_A3.html', context)



def A4_popular_name(request):
    return render(request, 'A4_popular_name.html')

def result_A4(request):
    bday = request.GET.get('bday')
    sex = request.GET.get('sex')
    korea_popular_m_name = ['윤우', '정우', '정우', '예준', '지후', '도하', '진우', '수현', '진우', '은호', '이현', '지후',
                            '승우', '유준', '하준', '서우', '시우', '유준', '시온', '서우', '이준', '다온', '도현', '선우',
                            '이안', '다온', '로운', '지호', '지환', '지호', '예준', '서준', '하진', '현우', '예준', '수호',
                            '건우', '유찬', '로운', '하민', '선우', '수현', '주원', '지호', '민준', '민재', '도현', '다온',
                            '지훈', '민준', '이현', '로운', '지안', '승우', '하준', '서진', '서진', '이안', '우주', '주안',
                            '시후', '도하', '윤우', '이현', '시현', '지한', '지후', '윤호', '하온', '시안', '이든', '승우',
                            '유준', '현우', '하준', '준서', '시온', '이든', '지훈', '태윤', '승우', '시안', '유준', '시후',
                            '지호', '지안', '우주', '시후', '재윤', '윤우', '지훈', '하민', '지우', '정우', '재윤', '하준',
                            '지오', '이든', '준우', '시안', '예준', '유준', '재윤', '준서', '윤호', '지오', '시우', '하진',
                            '재윤', '서준', '은호', '태윤', '태윤', '지환', '승우', '시후', '태윤', '선우', '유준', '시현',
                            '하준', '주원', '은우', '이든', '민준', '이든', '민준', '우진', '주원', '정우', '하준', '이안',
                            '유찬', '시우', '시후', '민준', '민재', '수현', '우진', '유찬', '하온', '우진', '도윤', '유준',
                            '민준', '연우', '지환', '윤호', '시우', '주안', '시후', '시현', '윤우', '유준', '연우', '승우',
                            '하온', '유찬', '우주', '지호', '수현', '민준', '주안', '지오', '선우', '민준', '지우', '준우',
                            '도윤', '시현', '주원', '율', '현준', '유준', '도하', '이안', '지호', '윤우', '다온', '지한',
                            '지한', '이현', '지한', '지후', '유준', '지안', '우주', '서준', '민준', '시현', '준우', '지우',
                            '로운', '수현', '수호', '민준', '유찬', '이현', '지오', '윤호', '이든', '준우', '시우', '도윤',
                            '시현', '이현', '지훈', '은호', '하준', '은우', '민재', '하온', '하준', '지후', '태윤', '윤우',
                            '지우', '시우', '민재', '수호', '진우', '현준', '지우', '우진', '도현', '선우', '지안', '도현',
                            '윤호', '하온', '이현', '지호', '윤호', '도하', '윤호', '수호', '진우', '도현', '시우', '수호',
                            '민준', '진우', '민준', '하민', '현준', '도현', '수현', '도현', '이준', '시온', '시온', '승우',
                            '유찬', '시후', '하민', '민준', '로운', '시안', '지안', '민준', '정우', '시후', '민준', '선우',
                            '이든', '현준', '시우', '율', '민재', '하민', '지훈', '시원', '승우', '시우', '도윤', '지호',
                            '도하', '다온', '지훈', '시후', '도윤', '정우', '지한', '서준', '서준', '하민', '서진', '주안',
                            '시현', '지우', '서진', '도하', '진우', '지우', '진우', '유준', '우진', '하민', '다온', '하준',
                            '건우', '서진', '하온', '현준', '민준', '시현', '지후', '진우', '정우', '현준', '은호', '하민',
                            '도현', '주안', '건우', '윤우', '주원', '시안', '유찬', '수호', '이든', '주안', '현우', '주안',
                            '은호', '하진', '율', '서우', '윤우', '다온', '선우', '시안', '시우', '민준', '시온', '시후',
                            '예준', '시우', '준우', '서준', '도하', '준우', '민준', '지후', '정우', '유찬', '지후', '태윤',
                            '서준', '우진', '수현', '도현', '지우', '선우', '시현', '하민', '도현', '민준', '하온', '민준',
                            '지안', '민준', '재윤', '서준', '준서']
    korea_popular_fm_name = ['유나', '나윤', '다인', '나은', '다은', '시은', '서현', '서아', '예린', '지율', '지율', '서윤',
                             '채아', '하윤', '서우', '예서', '하린', '다연', '연우', '수빈', '서현', '소민', '아윤', '서은',
                             '나윤', '나은', '시아', '사랑', '하린', '소민', '다윤', '서연', '주아', '윤아', '윤서', '주아',
                             '서율', '예은', '하율', '소민', '유하', '서윤', '소민', '다인', '소은', '다인', '지율', '서현',
                             '아윤', '다온', '지민', '하린', '나은', '아린', '다은', '세아', '지유', '하린', '서하', '채원',
                             '다은', '다은', '아인', '서아', '하율', '지유', '다윤', '은서', '유주', '서연', '유진', '아윤',
                             '채은', '지율', '소민', '소민', '소윤', '윤아', '예린', '지율', '수아', '세아', '아린', '소윤',
                             '주아', '채원', '연서', '지아', '나윤', '예은', '예은', '시은', '채은', '수빈', '수아', '예린',
                             '주아', '지민', '채은', '은서', '유하', '다인', '수아', '채아', '서윤', '유주', '나은', '서우',
                             '지윤', '하은', '예서', '지안', '하율', '아인', '예나', '서은', '하은', '소윤', '시아', '지유',
                             '소윤', '연서', '윤아', '서하', '서율', '예은', '다은', '아윤', '다은', '봄', '예나', '아린',
                             '채윤', '나윤', '연우', '민서', '지우', '민서', '서은', '소율', '민서', '유나', '세아', '연서',
                             '주아', '윤서', '하윤', '시아', '아인', '소윤', '아인', '채은', '유하', '연우', '시아', '소민',
                             '예은', '연서', '소은', '지아', '시아', '다윤', '수아', '윤아', '서율', '유진', '다온', '예린',
                             '서은', '유나', '연서', '소민', '지율', '지유', '소은', '세아', '수빈', '유나', '시아', '소민',
                             '윤서', '지우', '채은', '하린', '서우', '채윤', '다현', '채은', '수빈', '윤아', '서하', '채윤',
                             '지윤', '다연', '하율', '다은', '사랑', '다인', '서아', '예은', '봄', '민서', '소율', '지윤',
                             '지민', '채원', '윤서', '하윤', '예린', '서율', '다온', '세아', '수빈', '채아', '아린', '예서',
                             '다인', '유하', '윤아', '지안', '시은', '아인', '지율', '지민', '다연', '채윤', '유진', '예나',
                             '수아', '은서', '채윤', '유하', '서은', '예서', '지유', '민서', '민서', '수빈', '유나', '서아',
                             '수빈', '다인', '다인', '민서', '서윤', '시은', '하윤', '소은', '지안', '서현', '지유', '지안',
                             '서윤', '하린', '서율', '시아', '소윤', '다현', '예린', '유진', '다인', '사랑', '세아', '소율',
                             '시아', '아윤', '서현', '지유', '다은', '다온', '지율', '봄', '봄', '하윤', '예은', '시은',
                             '소은', '민서', '다윤', '연우', '예린', '연우', '시은', '하은', '주아', '나윤', '하린', '서율',
                             '유주', '은서', '다윤', '은서', '연서', '채아', '서현', '나윤', '하율', '예린', '주아', '지율',
                             '채아', '지율', '서율', '나윤', '유하', '지아', '유나', '예린', '서연', '윤아', '서하', '예은',
                             '예은', '예나', '소민', '서하', '연우', '민서', '다윤', '하은', '시은', '하율', '서우', '봄',
                             '은서', '서은', '다은', '채은', '봄', '연서', '다현', '시은', '다현', '채은', '예린', '나윤',
                             '소율', '서하', '소은', '소윤', '서하', '지아', '지유', '하율', '유주', '윤아', '세아', '소민',
                             '하율', '연서', '나은', '사랑', '다연', '소윤', '아인', '지아', '봄', '서현', '연서', '아윤',
                             '서율', '서은', '채원', '유나', '서우']

    month = bday[5:7]
    day = bday[8:]
    d0 = date(2019, 1, 1)
    d1 = date(2019, int(month), int(day))  # 날짜 저장.
    delta = d1 - d0

    if (sex == '1'):
        result = korea_popular_m_name[delta.days]
    elif (sex == '0'):
        result = korea_popular_fm_name[delta.days]
    context = {'bday': bday, 'sex': sex, 'name': result}
    return render(request, 'result_A4.html', context)



def A5_fetus_name(request):
    return render(request, 'A5_fetus_name.html')

def A5_1_pure_fetus_name(request):
    return render(request, 'A5_1_pure_fetus_name.html')

def result_A5(request):
    bday = request.GET.get('bday')
    fetus_pure_name = ['참이', '큰아', '찬들이', '찬슬이', '찬놀이', '푸르니', '큰맘이',
                       '튼싹이', '키움이', '초롱이', '찬솔이', '찬놀이', '큰솔이', '튼튼이',
                       '파란이', '큰맘이', '찬늘이', '튼싹이', '찬늘이', '토리', '푸르니',
                       '토리', '큰맘이', '찬놀이', '찬놀이', '파랑이', '찬솔이', '큰힘이',
                       '큰아', '큰힘이', '찬놀이', '찬놀이', '큰맘이', '초롬이', '초롬이',
                       '초롱이', '찬솔이', '파란이', '참이', '찬슬이', '토리', '큰아',
                       '파랑이', '파란이', '초롬이', '찬슬이', '파란이', '푸르니', '초롬이',
                       '튼튼이', '튼싹이', '참이', '파랑이', '찬들이', '파랑이', '튼튼이',
                       '파랑이', '큰솔이', '토리', '파란이', '참이', '찬놀이', '찬늘이',
                       '찬슬이', '찬들이', '튼튼이', '파란이', '찬늘이', '찬슬이', '찬늘이',
                       '키움이', '찬슬이', '파란이', '큰맘이', '찬늘이', '토리', '초롬이',
                       '큰아', '찬들이', '찬늘이', '토리', '토리', '토리', '푸르니',
                       '큰맘이', '키움이', '찬슬이', '토리', '튼튼이', '파랑이', '파랑이',
                       '파란이', '키움이', '튼튼이', '찬슬이', '찬슬이', '큰솔이', '큰맘이',
                       '파랑이', '찬솔이', '찬늘이', '찬놀이', '초롱이', '찬늘이', '큰솔이',
                       '튼싹이', '찬들이', '큰힘이', '큰아', '찬늘이', '튼튼이', '찬들이',
                       '튼싹이', '초롬이', '찬솔이', '파랑이', '초롱이', '튼튼이', '푸르니',
                       '찬늘이', '푸르니', '찬늘이', '튼싹이', '큰아', '찬놀이', '큰힘이',
                       '푸르니', '파랑이', '찬들이', '튼튼이', '찬놀이', '파랑이', '파랑이',
                       '튼싹이', '초롱이', '파란이', '큰힘이', '푸르니', '큰맘이', '큰힘이',
                       '찬솔이', '초롱이', '참이', '파랑이', '큰힘이', '키움이', '큰맘이',
                       '파랑이', '찬놀이', '파랑이', '파란이', '토리', '찬들이', '찬슬이',
                       '찬늘이', '찬놀이', '큰힘이', '키움이', '튼싹이', '파랑이', '토리',
                       '큰아', '찬슬이', '초롱이', '푸르니', '푸르니', '푸르니', '큰솔이',
                       '초롬이', '찬놀이', '튼튼이', '큰아', '큰맘이', '찬슬이', '파랑이',
                       '큰솔이', '참이', '찬놀이', '참이', '초롬이', '찬솔이', '찬솔이',
                       '초롬이', '찬들이', '튼싹이', '큰맘이', '찬슬이', '파란이', '참이',
                       '큰아', '큰힘이', '파랑이', '초롬이', '토리', '큰맘이', '튼싹이',
                       '큰솔이', '튼튼이', '키움이', '파랑이', '초롬이', '초롱이', '큰솔이',
                       '튼튼이', '찬들이', '초롬이', '튼튼이', '찬들이', '찬솔이', '참이',
                       '파랑이', '토리', '찬들이', '푸르니', '큰힘이', '찬슬이', '큰솔이',
                       '초롬이', '큰맘이', '파란이', '초롱이', '찬솔이', '토리', '토리',
                       '찬솔이', '키움이', '파란이', '찬놀이', '파랑이', '큰솔이', '초롬이',
                       '큰솔이', '파랑이', '키움이', '파란이', '찬들이', '큰힘이', '큰아',
                       '초롬이', '큰솔이', '큰힘이', '큰아', '파란이', '파란이', '튼튼이',
                       '키움이', '큰힘이', '큰힘이', '찬솔이', '참이', '찬늘이', '초롱이',
                       '찬늘이', '초롬이', '찬들이', '초롬이', '토리', '토리', '초롬이',
                       '토리', '파랑이', '초롬이', '큰아', '큰솔이', '튼싹이', '튼튼이',
                       '큰솔이', '파란이', '초롱이', '큰맘이', '큰솔이', '초롱이', '튼싹이',
                       '찬놀이', '초롬이', '파랑이', '참이', '파랑이', '찬슬이', '큰아',
                       '찬들이', '큰힘이', '키움이', '찬슬이', '찬슬이', '참이', '큰아',
                       '초롬이', '찬슬이', '초롱이', '초롬이', '토리', '초롬이', '참이',
                       '찬슬이', '파랑이', '찬슬이', '찬들이', '초롱이', '찬솔이', '참이',
                       '파랑이', '찬솔이', '큰솔이', '토리', '큰맘이', '파랑이', '파란이',
                       '큰맘이', '튼싹이', '푸르니', '푸르니', '파란이', '큰솔이', '참이',
                       '초롱이', '파랑이', '토리', '푸르니', '파랑이', '찬슬이', '찬놀이',
                       '초롬이', '키움이', '초롱이', '파란이', '파랑이', '찬들이', '찬놀이',
                       '찬들이', '키움이', '초롬이', '파랑이', '초롬이', '파랑이', '파란이',
                       '찬늘이', '초롬이', '찬놀이', '파랑이', '초롬이', '찬놀이', '튼튼이',
                       '참이', '큰아', '초롬이', '큰힘이', '키움이', '초롬이', '찬놀이',
                       '푸르니', '찬솔이', '큰솔이', '찬늘이', '초롬이', '튼튼이', '튼싹이',
                       '큰힘이', '찬늘이', '찬솔이', '키움이', '튼튼이', '초롬이', '큰솔이',
                       '푸르니']

    month = bday[5:7]
    day = bday[8:]
    d0 = date(2019, 1, 1)
    d1 = date(2019, int(month), int(day))  # 날짜 저장.
    delta = d1 - d0

    result = fetus_pure_name[delta.days]

    context = {'bday': bday, 'name': result}
    return render(request, 'result_A5.html', context)

def A5_2_well_hearded_fetus_name(request):
    return render(request, 'A5_2_well_hearded_fetus_name.html')


def result_A52(request):
    bday = request.GET.get('bday')
    well_fetus_name = ['콩콩이', '톨톨이', '퐁퐁이', '팔팔이', '통통이', '까까', '뿡뿡이', '까까', '꼬꼬',
                       '풍풍이', '탕탕이', '빵빵이', '퐁퐁이', '뿌뿌', '팡팡이', '통통이', '뿡뿡이', '까까',
                       '탕탕이', '톨톨이', '꼬꼬', '통통이', '쫑쫑이', '까까', '팔팔이', '꾸꾸', '퐁퐁이',
                       '짠짠이', '뿡뿡이', '뽀뽀', '뚠뚠이', '땅땅이', '팔팔이', '쫑쫑이', '쫑쫑이', '쪼쪼',
                       '팔팔이', '퉁퉁이', '팔팔이', '팔팔이', '퐁퐁이', '꼬꼬', '짠짠이', '쪼쪼', '빵빵이',
                       '톨톨이', '까까', '쫑쫑이', '뿌뿌', '포포', '꾸꾸', '쫑쫑이', '까까', '뿡뿡이', '뚠뚠이',
                       '통통이', '짱짱이', '쭈쭈', '또또', '쫑쫑이', '통통이', '쿤쿤이', '쿤쿤이', '뚜뚜', '뿌뿌',
                       '꾸꾸', '톨톨이', '쿤쿤이', '꾸꾸', '퉁퉁이', '팔팔이', '톨톨이', '탄탄이', '퐁퐁이', '퐁퐁이',
                       '땅땅이', '쫑쫑이', '뿡뿡이', '팔팔이', '쫑쫑이', '땅땅이', '탄탄이', '쭈쭈', '쪼쪼', '팔팔이',
                       '쪼쪼', '탄탄이', '퐁퐁이', '짱짱이', '쿤쿤이', '뚠뚠이', '꼬꼬', '빵빵이', '빵빵이', '꼬꼬',
                       '까까', '퉁퉁이', '뿡뿡이', '뚜뚜', '짱짱이', '뚠뚠이', '탕탕이', '뽀뽀', '뚜뚜', '뚠뚠이',
                       '쿤쿤이', '퉁퉁이', '또또', '쫑쫑이', '퉁퉁이', '짱짱이', '퐁퐁이', '똘똘이', '짱짱이', '퉁퉁이',
                       '똘똘이', '통통이', '까까', '퐁퐁이', '톨톨이', '포포', '쫑쫑이', '뚠뚠이', '똘똘이', '쿤쿤이',
                       '똘똘이', '땅땅이', '탄탄이', '콩콩이', '콩콩이', '꼬꼬', '통통이', '뿌뿌', '통통이', '팔팔이',
                       '빵빵이', '뿌뿌', '팔팔이', '꼬꼬', '꾸꾸', '퐁퐁이', '쭈쭈', '팔팔이', '쪼쪼', '또또', '꾸꾸',
                       '쿤쿤이', '까까', '통통이', '땅땅이', '탄탄이', '퐁퐁이', '퉁퉁이', '탕탕이', '꼬꼬', '탄탄이',
                       '또또', '쫑쫑이', '통통이', '탕탕이', '팔팔이', '짠짠이', '뚠뚠이', '까까', '탄탄이', '탄탄이',
                       '톨톨이', '뿌뿌', '쫑쫑이', '탄탄이', '포포', '탕탕이', '퐁퐁이', '팔팔이', '꾸꾸', '퐁퐁이',
                       '뽀뽀', '까까', '톨톨이', '톨톨이', '쿤쿤이', '쭈쭈', '톨톨이', '탕탕이', '퐁퐁이', '짱짱이',
                       '팔팔이', '뿌뿌', '뿡뿡이', '땅땅이', '꾸꾸', '쭈쭈', '짠짠이', '짱짱이', '쪼쪼', '쿤쿤이',
                       '또또', '뚠뚠이', '콩콩이', '뚜뚜', '포포', '콩콩이', '쿤쿤이', '꼬꼬', '쭈쭈', '퐁퐁이',
                       '풍풍이', '뚜뚜', '짱짱이', '쭈쭈', '탕탕이', '꾸꾸', '쿤쿤이', '팡팡이', '빵빵이', '퐁퐁이',
                       '뽀뽀', '까까', '쿤쿤이', '꼬꼬', '풍풍이', '탕탕이', '퉁퉁이', '콩콩이', '통통이', '탕탕이',
                       '꾸꾸', '톨톨이', '뚜뚜', '빵빵이', '뚠뚠이', '뚜뚜', '땅땅이', '콩콩이', '뚜뚜', '퉁퉁이',
                       '짠짠이', '똘똘이', '톨톨이', '땅땅이', '탕탕이', '빵빵이', '팡팡이', '퐁퐁이', '똘똘이',
                       '짠짠이', '뚜뚜', '통통이', '통통이', '또또', '빵빵이', '또또', '까까', '빵빵이', '쪼쪼',
                       '풍풍이', '탕탕이', '똘똘이', '또또', '통통이', '톨톨이', '포포', '포포', '뿌뿌', '탄탄이',
                       '쭈쭈', '풍풍이', '팡팡이', '톨톨이', '꾸꾸', '쿤쿤이', '쭈쭈', '꼬꼬', '빵빵이', '포포',
                       '똘똘이', '통통이', '탕탕이', '짠짠이', '쪼쪼', '팔팔이', '까까', '콩콩이', '풍풍이', '팔팔이',
                       '짱짱이', '뚠뚠이', '쭈쭈', '포포', '뿡뿡이', '빵빵이', '팔팔이', '뚠뚠이', '콩콩이', '퉁퉁이',
                       '퐁퐁이', '팡팡이', '뚜뚜', '뿌뿌', '탕탕이', '탕탕이', '탕탕이', '꾸꾸', '빵빵이', '땅땅이',
                       '퉁퉁이', '빵빵이', '빵빵이', '똘똘이', '꾸꾸', '퉁퉁이', '팔팔이', '뿌뿌', '팔팔이', '빵빵이',
                       '짠짠이', '쿤쿤이', '팔팔이', '탄탄이', '쭈쭈', '짠짠이', '퉁퉁이', '까까', '쿤쿤이', '쭈쭈',
                       '팡팡이', '뽀뽀', '또또', '똘똘이', '팡팡이', '뚠뚠이', '꾸꾸', '뽀뽀', '탄탄이', '짱짱이',
                       '짱짱이', '뚠뚠이', '뿌뿌', '쭈쭈', '짱짱이', '짠짠이', '퐁퐁이', '뽀뽀', '퉁퉁이', '까까',
                       '꼬꼬', '빵빵이', '팔팔이', '또또', '뚜뚜', '뿌뿌', '통통이', '뚠뚠이', '짱짱이', '또또',
                       '까까', '땅땅이', '꼬꼬', '똘똘이', '팔팔이', '쭈쭈', '쿤쿤이', '쪼쪼', '쭈쭈', '꾸꾸']
    month = bday[5:7]
    day = bday[8:]
    d0 = date(2019, 1, 1)
    d1 = date(2019, int(month), int(day))  # 날짜 저장.
    delta = d1 - d0
    result = well_fetus_name[delta.days]
    context = { 'name': result}
    return render(request, 'result_A52.html', context)

def B_nick_name_list(request):
    return render(request, 'B_nick_name_list.html')


def B1_random_nick_name(request):
    return render(request, 'B1_random_nick_name.html')

def result_B1(request):  # 무지 추가

    jong1 = ('ㅇ')
    jong2 = ('ㄴ')
    jong3 = ('ㅁ')
    jong4 = ('ㄱ')
    joong1 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅠ', 'ㅣ')
    joong2 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅣ')

    easy = ('ㄱ', 'ㄴ', 'ㄷ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅅ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅌ', 'ㅎ')
    letters = []
    for i in range(10000):
        result_cho = random.choice(easy)
        if result_cho in ('ㄱ'):
            result_joong = random.choice(joong1)
            if result_joong in ('ㅏ'):
                jong_result = random.choice(jong1)
            elif result_joong in ('ㅜ', 'ㅠ'):
                jong_result = random.choice(jong2)
            else:
                jong_result = ''
        elif result_cho in ('ㄴ'):
            result_joong = random.choice(joong2)
            jong_result = ''
        elif result_cho in ('ㄷ'):
            joong3 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅐ', 'ㅣ')
            result_joong = random.choice(joong3)
            if result_joong in ('ㅏ'):
                jong_result = random.choice(jong2)
            elif result_joong in ('ㅗ'):
                jong_result = random.choice(jong1)
            else:
                jong_result = ''
        elif result_cho in ('ㄹ'):
            joong4 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅐ', 'ㅣ', 'ㅕ')
            result_joong = random.choice(joong4)
            if result_joong in ('ㅏ', 'ㅗ', 'ㅣ'):
                jong_result = random.choice(jong2)
            elif result_joong in ('ㅏ', 'ㅗ', 'ㅣ'):
                jong_result = random.choice(jong1)
            else:
                jong_result = ''
        elif result_cho in ('ㅁ', 'ㅂ'):
            joong5 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅣ')
            result_joong = random.choice(joong5)
            if result_joong in ('ㅣ'):
                jong_result = random.choice(jong2)
            else:
                jong_result = ''
        elif result_cho in ('ㅅ'):
            joong6 = ('ㅏ', 'ㅔ', 'ㅓ', 'ㅗ', 'ㅜ', 'ㅣ')
            result_joong = random.choice(joong6)
            if result_joong in ('ㅏ', 'ㅣ'):
                jong_result = random.choice(jong2)
            elif result_joong in ('ㅗ'):
                jong_result = random.choice(jong1)
            else:
                jong_result = ''
        elif result_cho in ('ㅇ'):
            joong7 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅐ', 'ㅓ', 'ㅕ', 'ㅣ')
            result_joong = random.choice(joong7)
            if result_joong in ('ㅏ', 'ㅐ', 'ㅗ', 'ㅜ', 'ㅣ'):
                jong_result = random.choice(jong2)
            elif result_joong in ('ㅣ'):
                jong_result = random.choice(jong3)
            else:
                jong_result = ''
        elif result_cho in ('ㅈ'):
            joong8 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅐ', 'ㅓ', 'ㅣ')
            result_joong = random.choice(joong8)
            if result_joong in ('ㅜ', 'ㅣ'):
                jong_result = random.choice(jong2)
            elif result_joong in ('ㅗ'):
                jong_result = random.choice(jong1)
            else:
                jong_result = ''
        elif result_cho in ('ㅊ'):
            joong1 = ('ㅏ', 'ㅗ')
            result_joong = random.choice(joong1)
            if result_joong in ('ㅏ'):
                jong_result = random.choice(jong2)
            else:
                jong_result = ''
        elif result_cho in ('ㅌ'):
            joong2 = ('ㅏ', 'ㅐ')
            result_joong = random.choice(joong2)
            if result_joong in ('ㅏ'):

                jong_result = random.choice(jong4)
            else:
                jong_result = ''
        elif result_cho in ('ㅎ'):
            joong9 = ('ㅏ', 'ㅗ', 'ㅜ', 'ㅐ', 'ㅣ', 'ㅟ')
            result_joong = random.choice(joong9)
            if result_joong in ('ㅏ', 'ㅜ'):
                jong_result = random.choice(jong2)
            elif result_joong in ('ㅗ'):
                jong_result = random.choice(jong1)
            else:
                jong_result = ''
        else:
            result_cho = False

        if jong_result:
            letters.append(hgtk.letter.compose(result_cho, result_joong, jong_result))
        else:
            letters.append(hgtk.letter.compose(result_cho, result_joong))

    letters = list(set(letters))
    ch_num = int(request.GET.get('ca_num'))
    print(type(ch_num))
    letter = random.sample(letters, ch_num)
    name = ''.join(letter)
    context = {'name': name}
    return render(request, 'result_B1.html', context)


def B2_novel_nick_name(request):
    return render(request, 'B2_novel_nick_name.html')


def C_others_list(request):
    return render(request, 'C_others_list.html')


def C1_random(request):
    return render(request, 'C1_random.html')

def C1_random_2(request):
    random_num = request.GET.get('random_num')
    range_r = range(int(random_num))
    context = {'range': range_r}
    return render(request, 'C1_random_2.html', context)

def result_C1(request):  # 무지 추가
    result = random.choice(request.GET.getlist('random_input'))
    context = {'result': result}
    return render(request, 'result_C1.html', context)


def C2_lotto(request):
    return render(request, 'C2_lotto.html')

def C2_lotto2(request):
    return render(request, 'C2_lotto2.html')

def C2_1_random_lotto(request):
    return render(request, 'C2_1_random_lotto.html')


def C2_2_unit_lotto(request):
    return render(request, 'C2_2_unit_lotto.html')

def result_C2(request):
    result = []
    lotto_num = request.GET.get('lotto_num')
    for i in range(int(lotto_num)):
        lotto = random.sample(range(1, 46), 6)
        lotto.sort()
        result.append(lotto)
    len_r = range(int(lotto_num))
    context = {'result': result, 'len_r': len_r}
    return render(request, 'result_C2.html', context)


def result_C22(request):
    input_num_1 = int(request.GET.get('input_num_1'))
    input_num_10 = int(request.GET.get('input_num_10'))
    input_num_20 = int(request.GET.get('input_num_20'))
    input_num_30 = int(request.GET.get('input_num_30'))
    input_num_40 = int(request.GET.get('input_num_40'))

    if (input_num_1 + input_num_10 + input_num_20 + input_num_30 + input_num_40 == 6):

        lotto_1 = random.sample(range(1, 11), input_num_1)
        lotto_10 = random.sample(range(10, 20), input_num_10)
        lotto_20 = random.sample(range(20, 30), input_num_20)
        lotto_30 = random.sample(range(30, 40), input_num_30)
        lotto_40 = random.sample(range(40, 46), input_num_40)

        lotto_list = lotto_1 + lotto_10 + lotto_20 + lotto_30 + lotto_40
        lotto_list.sort()

        result = lotto_list

    else:
        result = ['로또 번호 개수는 6개 입니다. 다시 확인해주세요.']

    context = {'lotto_list': result}
    return render(request, 'result_C22.html', context)

